In [1]:
import pandas as pd, numpy as np

In [3]:
df1 = pd.DataFrame({'A':[None,1],'B':[None,2]})
df1

     A    B
0  NaN  NaN
1  1.0  2.0

In [4]:
df2 = pd.DataFrame({'A':[3,3],'B':[4,4]})
df2

   A  B
0  3  4
1  3  4

# 7.4.1 相同位置更新空元素 df.combine_first()

In [5]:
df1.combine_first(df2)

     A    B
0  3.0  4.0
1  1.0  2.0

In [7]:
df2 = pd.DataFrame({'A':[3,3],'C':[4,4]}, index=[1,2])
df2

   A  C
1  3  4
2  3  4

In [10]:
# df1中的A空值由于没有B中相同位置的值来替换，仍然为空
df1.combine_first(df2)

     A    B    C
0  NaN  NaN  NaN
1  1.0  2.0  4.0
2  3.0  NaN  4.0

In [11]:
df1

     A    B
0  NaN  NaN
1  1.0  2.0

# 7.4.2 df.combine()

In [12]:
df1 = pd.DataFrame({'A':[1,2],'B':[3,4]})
df1

   A  B
0  1  3
1  2  4

In [13]:
df2 = pd.DataFrame({'A':[0,3],'B':[2,1]})
df2

   A  B
0  0  2
1  3  1

In [14]:
# 合并，s1和s2对应位置上哪个值大就返回哪个值
df1.combine(df2,lambda s1,s2:np.where(s1>s2, s1, s2))
df1.combine(df2, np.maximum)

   A  B
0  1  3
1  3  4

In [17]:
# 合并，s1和s2对应位置上哪个值小就返回哪个值
df1.combine(df2, np.minimum)

   A  B
0  0  2
1  2  1

# 7.4.3 df.update()

In [18]:
df1 = pd.DataFrame({'A':[None,2],'B':[5,6]})
df1

     A  B
0  NaN  5
1  2.0  6

In [19]:
df2 = pd.DataFrame({'A':[0,2],'B':[None,7]})
df2

   A    B
0  0  NaN
1  2  7.0

In [21]:
# 合并，所有空值被对应位置的值替换
df1.update(df2)

In [22]:
df1

     A    B
0  0.0  5.0
1  2.0  7.0

In [ ]:
# 如果不想更新df1，使用参数 overwrite=False